import React from 'react';
import Container from '../../components/Container';
import Header from '../../components/Header';
import Footer from '../../components/Footer';
import Search from '../../components/Search';
import Show from '../../components/Show';
import Tabs from '../../components/Tabs';
import styles from './Main.css';

const data = [
	{
		ID: "58ab56b1e17838742ffeb0b6",
		Title: "Өскә",
		Text: "78 яшьлек мыгырдык Карл Фредриксен тормышы аны урап узып бара дип уйлый. Зур хыялын һәм мәрхүм хатынына биргән вәгъдәсен үтәр өчен, ул, өенә меңләгән шарлар бәйләп, Көньяк Америкага маҗаралар эзләргә очып китәргә уйлый. Ярты миль да узалмый, бер әйбер ачыклана: карт ялгыш кына кечкенә бертуктамый сөйләүче шат күңелле 8 яшьлек Расселны да үзе белән эләктереп киткән..",
		Img: "http://89.223.31.219:4000/up.jpg",
		Href: "/movies",
		Video: "http://89.223.31.219:4000/Up_cartoon.mp4",
		Time: "101",
		Year: "2009",
		Genres: "балаларга, мультфильм, маҗаралар, гайләви"
	},{
		ID: "58ab56b1e17838742ffeb0b6",
		Title: "Өскә",
		Text: "78 яшьлек мыгырдык Карл Фредриксен тормышы аны урап узып бара дип уйлый. Зур хыялын һәм мәрхүм хатынына биргән вәгъдәсен үтәр өчен, ул, өенә меңләгән шарлар бәйләп, Көньяк Америкага маҗаралар эзләргә очып китәргә уйлый. Ярты миль да узалмый, бер әйбер ачыклана: карт ялгыш кына кечкенә бертуктамый сөйләүче шат күңелле 8 яшьлек Расселны да үзе белән эләктереп киткән..",
		Img: "http://89.223.31.219:4000/up.jpg",
		Href: "/movies",
		Video: "http://89.223.31.219:4000/Up_cartoon.mp4",
		Time: "101",
		Year: "2009",
		Genres: "балаларга, мультфильм, маҗаралар, гайләви"
	},{
		ID: "58ab56b1e17838742ffeb0b6",
		Title: "Өскә",
		Text: "78 яшьлек мыгырдык Карл Фредриксен тормышы аны урап узып бара дип уйлый. Зур хыялын һәм мәрхүм хатынына биргән вәгъдәсен үтәр өчен, ул, өенә меңләгән шарлар бәйләп, Көньяк Америкага маҗаралар эзләргә очып китәргә уйлый. Ярты миль да узалмый, бер әйбер ачыклана: карт ялгыш кына кечкенә бертуктамый сөйләүче шат күңелле 8 яшьлек Расселны да үзе белән эләктереп киткән..",
		Img: "http://89.223.31.219:4000/up.jpg",
		Href: "/movies",
		Video: "http://89.223.31.219:4000/Up_cartoon.mp4",
		Time: "101",
		Year: "2009",
		Genres: "балаларга, мультфильм, маҗаралар, гайләви"
	},{
		ID: "58ab56b1e17838742ffeb0b6",
		Title: "Өскә",
		Text: "78 яшьлек мыгырдык Карл Фредриксен тормышы аны урап узып бара дип уйлый. Зур хыялын һәм мәрхүм хатынына биргән вәгъдәсен үтәр өчен, ул, өенә меңләгән шарлар бәйләп, Көньяк Америкага маҗаралар эзләргә очып китәргә уйлый. Ярты миль да узалмый, бер әйбер ачыклана: карт ялгыш кына кечкенә бертуктамый сөйләүче шат күңелле 8 яшьлек Расселны да үзе белән эләктереп киткән..",
		Img: "http://89.223.31.219:4000/up.jpg",
		Href: "/movies",
		Video: "http://89.223.31.219:4000/Up_cartoon.mp4",
		Time: "101",
		Year: "2009",
		Genres: "балаларга, мультфильм, маҗаралар, гайләви"
	},{
		ID: "58ab56b1e17838742ffeb0b6",
		Title: "Өскә",
		Text: "78 яшьлек мыгырдык Карл Фредриксен тормышы аны урап узып бара дип уйлый. Зур хыялын һәм мәрхүм хатынына биргән вәгъдәсен үтәр өчен, ул, өенә меңләгән шарлар бәйләп, Көньяк Америкага маҗаралар эзләргә очып китәргә уйлый. Ярты миль да узалмый, бер әйбер ачыклана: карт ялгыш кына кечкенә бертуктамый сөйләүче шат күңелле 8 яшьлек Расселны да үзе белән эләктереп киткән..",
		Img: "http://89.223.31.219:4000/up.jpg",
		Href: "/movies",
		Video: "http://89.223.31.219:4000/Up_cartoon.mp4",
		Time: "101",
		Year: "2009",
		Genres: "балаларга, мультфильм, маҗаралар, гайләви"
	},{
		ID: "58ab56b1e17838742ffeb0b6",
		Title: "Өскә",
		Text: "78 яшьлек мыгырдык Карл Фредриксен тормышы аны урап узып бара дип уйлый. Зур хыялын һәм мәрхүм хатынына биргән вәгъдәсен үтәр өчен, ул, өенә меңләгән шарлар бәйләп, Көньяк Америкага маҗаралар эзләргә очып китәргә уйлый. Ярты миль да узалмый, бер әйбер ачыклана: карт ялгыш кына кечкенә бертуктамый сөйләүче шат күңелле 8 яшьлек Расселны да үзе белән эләктереп киткән..",
		Img: "http://89.223.31.219:4000/up.jpg",
		Href: "/movies",
		Video: "http://89.223.31.219:4000/Up_cartoon.mp4",
		Time: "101",
		Year: "2009",
		Genres: "балаларга, мультфильм, маҗаралар, гайләви"
	},{
		ID: "58ab56b1e17838742ffeb0b6",
		Title: "Өскә",
		Text: "78 яшьлек мыгырдык Карл Фредриксен тормышы аны урап узып бара дип уйлый. Зур хыялын һәм мәрхүм хатынына биргән вәгъдәсен үтәр өчен, ул, өенә меңләгән шарлар бәйләп, Көньяк Америкага маҗаралар эзләргә очып китәргә уйлый. Ярты миль да узалмый, бер әйбер ачыклана: карт ялгыш кына кечкенә бертуктамый сөйләүче шат күңелле 8 яшьлек Расселны да үзе белән эләктереп киткән..",
		Img: "http://89.223.31.219:4000/up.jpg",
		Href: "/movies",
		Video: "http://89.223.31.219:4000/Up_cartoon.mp4",
		Time: "101",
		Year: "2009",
		Genres: "балаларга, мультфильм, маҗаралар, гайләви"
	},{
		ID: "58ab56b1e17838742ffeb0b6",
		Title: "Өскә",
		Text: "78 яшьлек мыгырдык Карл Фредриксен тормышы аны урап узып бара дип уйлый. Зур хыялын һәм мәрхүм хатынына биргән вәгъдәсен үтәр өчен, ул, өенә меңләгән шарлар бәйләп, Көньяк Америкага маҗаралар эзләргә очып китәргә уйлый. Ярты миль да узалмый, бер әйбер ачыклана: карт ялгыш кына кечкенә бертуктамый сөйләүче шат күңелле 8 яшьлек Расселны да үзе белән эләктереп киткән..",
		Img: "http://89.223.31.219:4000/up.jpg",
		Href: "/movies",
		Video: "http://89.223.31.219:4000/Up_cartoon.mp4",
		Time: "101",
		Year: "2009",
		Genres: "балаларга, мультфильм, маҗаралар, гайләви"
	},
];

const list = ['барсыда', 'кино', 'мультфильм', 'сериал'];

class Main extends React.Component {
	render() {
		return (
			<div className={styles.wrap}>
				<Header />
				<div className={styles.content}>
					<Container>
						<div className={styles.logo}></div>
						<div className={styles.toolbar}>
							<div className={styles.left}>
								<div className={styles.count}>{data.length} фильм</div>
								<Tabs list={list}/>
							</div>
							<Search handle={console.log} />
						</div>
						<div className={styles.showWrapper}>
							{data.map((item, i) => <Show data={item} key={i} />)}
						</div>
					</Container>
				</div>
				<Footer />
			</div>
		)
	}
}

export default Main;
